let player = 0;         // 現在の手番プレイヤー
let isEnd = false;      // 終了フラグ
let scores = [2, 2];    // 獲得石数
let types = ['MAN', 'COM']; // プレイヤー種類
let board = [           // 盤面
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 1, 0, 8, 8, 8],
    [8, 8, 8, 0, 1, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8]
];
let putToken = {x: 0, y: 0};    // ログ：石置き位置
let activeSquares = [];         // 配置可能マス配列
let revTokens = [];     // ログ：裏返した石の配列
