let revData = {
  player: 0, // 現在手番のプレイヤー
  isEnd: false, // 終了フラグ
  scores: [0, 0], // 獲得石数
  types: ["MAN", "COM"], // プレイヤー種類
  board: [
    // 盤面
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 0, 1, 8, 8, 8],
    [8, 8, 8, 1, 0, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8],
    [8, 8, 8, 8, 8, 8, 8, 8],
  ],
  putToken: { x: 0, y: 0 }, // ログ：石置き位置
  activeSquares: [], // 配置可能マス配列
  revTokens: [], // ログ：裏返した石の配列
};
console.log(revData.player);
